Revit 2026 API

# FailureMessageSetFailingElement Method

---

Sets the element that has caused the failure.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FailureMessage SetFailingElement(
	ElementId id
)
```
```vb
Public Function SetFailingElement (
	id As ElementId
) As FailureMessage
```
```cpp
public:
FailureMessage^ SetFailingElement(
	ElementId^ id
)
```
```fsharp
member SetFailingElement :
        id : ElementId -> FailureMessage
```

#### Parameters

id ElementId
     The element that has caused the failure.

#### Return Value

FailureMessage The FailureMessage.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | This FailureMessage is already posted to a document |

In Revit error dialog this element will be highlighted to the user and can be deleted by user via extended error dialog.

#### Reference

FailureMessage Class

Autodesk.Revit.DB Namespace